---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AssemblyNamingCategory
source: html/449e1909-3e6b-8494-68a0-e51fdc1bc6a1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AssemblyNamingCategory Property

"Naming Category"

## Syntax (C#)
```csharp
public static ForgeTypeId AssemblyNamingCategory { get; }
```